; ModuleID = '/home/runner/work/Test-Suite/Test-Suite/test_cases_bc/mem_leak/malloc9.c.bc'
source_filename = "/home/runner/work/Test-Suite/Test-Suite/src/mem_leak/malloc9.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.s_rr_node = type { i16, i16, i16, i16, i16, i16, ptr, ptr, float, float }

@rr_node = dso_local global ptr null, align 8, !dbg !0

; Function Attrs: noinline nounwind optnone uwtable
define dso_local ptr @SAFEMALLOC(i32 noundef %n) #0 !dbg !30 {
entry:
  %n.addr = alloca i32, align 4
  store i32 %n, ptr %n.addr, align 4
  call void @llvm.dbg.declare(metadata ptr %n.addr, metadata !36, metadata !DIExpression()), !dbg !37
  %0 = load i32, ptr %n.addr, align 4, !dbg !38
  %conv = sext i32 %0 to i64, !dbg !38
  %call = call noalias ptr @malloc(i64 noundef %conv) #3, !dbg !39
  ret ptr %call, !dbg !40
}

; Function Attrs: nofree nosync nounwind readnone speculatable willreturn
declare void @llvm.dbg.declare(metadata, metadata, metadata) #1

; Function Attrs: nounwind
declare dso_local noalias ptr @malloc(i64 noundef) #2

; Function Attrs: noinline nounwind optnone uwtable
define dso_local ptr @PLKMALLOC(i32 noundef %n) #0 !dbg !41 {
entry:
  %n.addr = alloca i32, align 4
  store i32 %n, ptr %n.addr, align 4
  call void @llvm.dbg.declare(metadata ptr %n.addr, metadata !42, metadata !DIExpression()), !dbg !43
  %0 = load i32, ptr %n.addr, align 4, !dbg !44
  %conv = sext i32 %0 to i64, !dbg !44
  %call = call noalias ptr @malloc(i64 noundef %conv) #3, !dbg !45
  ret ptr %call, !dbg !46
}

; Function Attrs: noinline nounwind optnone uwtable
define dso_local ptr @NFRMALLOC(i32 noundef %n) #0 !dbg !47 {
entry:
  %n.addr = alloca i32, align 4
  store i32 %n, ptr %n.addr, align 4
  call void @llvm.dbg.declare(metadata ptr %n.addr, metadata !48, metadata !DIExpression()), !dbg !49
  %0 = load i32, ptr %n.addr, align 4, !dbg !50
  %conv = sext i32 %0 to i64, !dbg !50
  %call = call noalias ptr @malloc(i64 noundef %conv) #3, !dbg !51
  ret ptr %call, !dbg !52
}

; Function Attrs: noinline nounwind optnone uwtable
define dso_local ptr @CLKMALLOC(i32 noundef %n) #0 !dbg !53 {
entry:
  %n.addr = alloca i32, align 4
  store i32 %n, ptr %n.addr, align 4
  call void @llvm.dbg.declare(metadata ptr %n.addr, metadata !54, metadata !DIExpression()), !dbg !55
  %0 = load i32, ptr %n.addr, align 4, !dbg !56
  %conv = sext i32 %0 to i64, !dbg !56
  %call = call noalias ptr @malloc(i64 noundef %conv) #3, !dbg !57
  ret ptr %call, !dbg !58
}

; Function Attrs: noinline nounwind optnone uwtable
define dso_local ptr @NFRLEAKFP(i32 noundef %n) #0 !dbg !59 {
entry:
  %n.addr = alloca i32, align 4
  store i32 %n, ptr %n.addr, align 4
  call void @llvm.dbg.declare(metadata ptr %n.addr, metadata !60, metadata !DIExpression()), !dbg !61
  %0 = load i32, ptr %n.addr, align 4, !dbg !62
  %conv = sext i32 %0 to i64, !dbg !62
  %call = call noalias ptr @malloc(i64 noundef %conv) #3, !dbg !63
  ret ptr %call, !dbg !64
}

; Function Attrs: noinline nounwind optnone uwtable
define dso_local ptr @PLKLEAKFP(i32 noundef %n) #0 !dbg !65 {
entry:
  %n.addr = alloca i32, align 4
  store i32 %n, ptr %n.addr, align 4
  call void @llvm.dbg.declare(metadata ptr %n.addr, metadata !66, metadata !DIExpression()), !dbg !67
  %0 = load i32, ptr %n.addr, align 4, !dbg !68
  %conv = sext i32 %0 to i64, !dbg !68
  %call = call noalias ptr @malloc(i64 noundef %conv) #3, !dbg !69
  ret ptr %call, !dbg !70
}

; Function Attrs: noinline nounwind optnone uwtable
define dso_local ptr @LEAKFN(i32 noundef %n) #0 !dbg !71 {
entry:
  %n.addr = alloca i32, align 4
  store i32 %n, ptr %n.addr, align 4
  call void @llvm.dbg.declare(metadata ptr %n.addr, metadata !72, metadata !DIExpression()), !dbg !73
  %0 = load i32, ptr %n.addr, align 4, !dbg !74
  %conv = sext i32 %0 to i64, !dbg !74
  %call = call noalias ptr @malloc(i64 noundef %conv) #3, !dbg !75
  ret ptr %call, !dbg !76
}

; Function Attrs: noinline nounwind optnone uwtable
define dso_local ptr @alloc() #0 !dbg !77 {
entry:
  %call = call ptr @NFRMALLOC(i32 noundef 10), !dbg !80
  ret ptr %call, !dbg !81
}

; Function Attrs: noinline nounwind optnone uwtable
define dso_local i32 @main() #0 !dbg !82 {
entry:
  %i = alloca i32, align 4
  call void @llvm.dbg.declare(metadata ptr %i, metadata !85, metadata !DIExpression()), !dbg !86
  %call = call ptr @alloc(), !dbg !87
  %0 = load ptr, ptr @rr_node, align 8, !dbg !88
  %1 = load i32, ptr %i, align 4, !dbg !89
  %idxprom = sext i32 %1 to i64, !dbg !88
  %arrayidx = getelementptr inbounds %struct.s_rr_node, ptr %0, i64 %idxprom, !dbg !88
  %edges = getelementptr inbounds %struct.s_rr_node, ptr %arrayidx, i32 0, i32 6, !dbg !90
  store ptr %call, ptr %edges, align 8, !dbg !91
  ret i32 0, !dbg !92
}

attributes #0 = { noinline nounwind optnone uwtable "frame-pointer"="all" "min-legal-vector-width"="0" "no-trapping-math"="true" "stack-protector-buffer-size"="8" "target-cpu"="x86-64" "target-features"="+cx8,+fxsr,+mmx,+sse,+sse2,+x87" "tune-cpu"="generic" }
attributes #1 = { nofree nosync nounwind readnone speculatable willreturn }
attributes #2 = { nounwind "frame-pointer"="all" "no-trapping-math"="true" "stack-protector-buffer-size"="8" "target-cpu"="x86-64" "target-features"="+cx8,+fxsr,+mmx,+sse,+sse2,+x87" "tune-cpu"="generic" }
attributes #3 = { nounwind }

!llvm.dbg.cu = !{!2}
!llvm.module.flags = !{!24, !25, !26, !27, !28}
!llvm.ident = !{!29}

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "rr_node", scope: !2, file: !5, line: 17, type: !6, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 14.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/runner/work/Test-Suite/Test-Suite/src/mem_leak/malloc9.c", directory: "/home/runner/work/Test-Suite/Test-Suite", checksumkind: CSK_MD5, checksum: "77ee16257947527d385aa7999c44a788")
!4 = !{!0}
!5 = !DIFile(filename: "src/mem_leak/malloc9.c", directory: "/home/runner/work/Test-Suite/Test-Suite", checksumkind: CSK_MD5, checksum: "77ee16257947527d385aa7999c44a788")
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_rr_node", file: !5, line: 10, size: 320, elements: !8)
!8 = !{!9, !11, !12, !13, !14, !15, !16, !19, !21, !23}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "xlow", scope: !7, file: !5, line: 11, baseType: !10, size: 16)
!10 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "xhigh", scope: !7, file: !5, line: 11, baseType: !10, size: 16, offset: 16)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "ylow", scope: !7, file: !5, line: 11, baseType: !10, size: 16, offset: 32)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "yhigh", scope: !7, file: !5, line: 11, baseType: !10, size: 16, offset: 48)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "ptc_num", scope: !7, file: !5, line: 12, baseType: !10, size: 16, offset: 64)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "num_edges", scope: !7, file: !5, line: 12, baseType: !10, size: 16, offset: 80)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "edges", scope: !7, file: !5, line: 13, baseType: !17, size: 64, offset: 128)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "switches", scope: !7, file: !5, line: 14, baseType: !20, size: 64, offset: 192)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "R", scope: !7, file: !5, line: 14, baseType: !22, size: 32, offset: 256)
!22 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !7, file: !5, line: 14, baseType: !22, size: 32, offset: 288)
!24 = !{i32 7, !"Dwarf Version", i32 5}
!25 = !{i32 2, !"Debug Info Version", i32 3}
!26 = !{i32 1, !"wchar_size", i32 4}
!27 = !{i32 7, !"uwtable", i32 1}
!28 = !{i32 7, !"frame-pointer", i32 2}
!29 = !{!"clang version 14.0.0"}
!30 = distinct !DISubprogram(name: "SAFEMALLOC", scope: !31, file: !31, line: 5, type: !32, scopeLine: 5, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !35)
!31 = !DIFile(filename: "memleak_check.h", directory: "/home/runner/work/Test-Suite/Test-Suite", checksumkind: CSK_MD5, checksum: "f78006bd129ed179fe44821c3aed9305")
!32 = !DISubroutineType(types: !33)
!33 = !{!34, !18}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!35 = !{}
!36 = !DILocalVariable(name: "n", arg: 1, scope: !30, file: !31, line: 5, type: !18)
!37 = !DILocation(line: 5, column: 22, scope: !30)
!38 = !DILocation(line: 6, column: 17, scope: !30)
!39 = !DILocation(line: 6, column: 10, scope: !30)
!40 = !DILocation(line: 6, column: 3, scope: !30)
!41 = distinct !DISubprogram(name: "PLKMALLOC", scope: !31, file: !31, line: 9, type: !32, scopeLine: 9, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !35)
!42 = !DILocalVariable(name: "n", arg: 1, scope: !41, file: !31, line: 9, type: !18)
!43 = !DILocation(line: 9, column: 21, scope: !41)
!44 = !DILocation(line: 10, column: 17, scope: !41)
!45 = !DILocation(line: 10, column: 10, scope: !41)
!46 = !DILocation(line: 10, column: 3, scope: !41)
!47 = distinct !DISubprogram(name: "NFRMALLOC", scope: !31, file: !31, line: 13, type: !32, scopeLine: 13, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !35)
!48 = !DILocalVariable(name: "n", arg: 1, scope: !47, file: !31, line: 13, type: !18)
!49 = !DILocation(line: 13, column: 21, scope: !47)
!50 = !DILocation(line: 14, column: 17, scope: !47)
!51 = !DILocation(line: 14, column: 10, scope: !47)
!52 = !DILocation(line: 14, column: 3, scope: !47)
!53 = distinct !DISubprogram(name: "CLKMALLOC", scope: !31, file: !31, line: 17, type: !32, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !35)
!54 = !DILocalVariable(name: "n", arg: 1, scope: !53, file: !31, line: 17, type: !18)
!55 = !DILocation(line: 17, column: 21, scope: !53)
!56 = !DILocation(line: 18, column: 17, scope: !53)
!57 = !DILocation(line: 18, column: 10, scope: !53)
!58 = !DILocation(line: 18, column: 3, scope: !53)
!59 = distinct !DISubprogram(name: "NFRLEAKFP", scope: !31, file: !31, line: 21, type: !32, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !35)
!60 = !DILocalVariable(name: "n", arg: 1, scope: !59, file: !31, line: 21, type: !18)
!61 = !DILocation(line: 21, column: 21, scope: !59)
!62 = !DILocation(line: 22, column: 17, scope: !59)
!63 = !DILocation(line: 22, column: 10, scope: !59)
!64 = !DILocation(line: 22, column: 3, scope: !59)
!65 = distinct !DISubprogram(name: "PLKLEAKFP", scope: !31, file: !31, line: 25, type: !32, scopeLine: 25, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !35)
!66 = !DILocalVariable(name: "n", arg: 1, scope: !65, file: !31, line: 25, type: !18)
!67 = !DILocation(line: 25, column: 21, scope: !65)
!68 = !DILocation(line: 26, column: 17, scope: !65)
!69 = !DILocation(line: 26, column: 10, scope: !65)
!70 = !DILocation(line: 26, column: 3, scope: !65)
!71 = distinct !DISubprogram(name: "LEAKFN", scope: !31, file: !31, line: 29, type: !32, scopeLine: 29, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !35)
!72 = !DILocalVariable(name: "n", arg: 1, scope: !71, file: !31, line: 29, type: !18)
!73 = !DILocation(line: 29, column: 18, scope: !71)
!74 = !DILocation(line: 30, column: 17, scope: !71)
!75 = !DILocation(line: 30, column: 10, scope: !71)
!76 = !DILocation(line: 30, column: 3, scope: !71)
!77 = distinct !DISubprogram(name: "alloc", scope: !5, file: !5, line: 19, type: !78, scopeLine: 19, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !35)
!78 = !DISubroutineType(types: !79)
!79 = !{!17}
!80 = !DILocation(line: 21, column: 9, scope: !77)
!81 = !DILocation(line: 21, column: 2, scope: !77)
!82 = distinct !DISubprogram(name: "main", scope: !5, file: !5, line: 24, type: !83, scopeLine: 24, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !35)
!83 = !DISubroutineType(types: !84)
!84 = !{!18}
!85 = !DILocalVariable(name: "i", scope: !82, file: !5, line: 26, type: !18)
!86 = !DILocation(line: 26, column: 6, scope: !82)
!87 = !DILocation(line: 27, column: 21, scope: !82)
!88 = !DILocation(line: 27, column: 2, scope: !82)
!89 = !DILocation(line: 27, column: 10, scope: !82)
!90 = !DILocation(line: 27, column: 13, scope: !82)
!91 = !DILocation(line: 27, column: 19, scope: !82)
!92 = !DILocation(line: 31, column: 1, scope: !82)
